{"podcast_details": {"podcast_title": "GENERATIVE AI", "episode_title": "Can AI Generate Original Content? | chatGPT Power Prompting | How to Pitch an Epic Sci-Fi Blockbuster | Episode 18", "episode_image": "https://storage.buzzsprout.com/variants/1co6z99u013o50dugu92yti6lmet/e70382d1824eed07bf51f8b9742413cd1ad490e9f893e8ff33e49d552d3c73ea.jpg", "episode_transcript": " Can AI generate original content that's good? I believe that's the unspoken question on the mind of Hollywood at the moment, whereas of August 15th, 2023, writers and actors are still on strike. AI is part of the complex issues currently being negotiated between actors, writers, producers, studios, and networks. As a case study of what AI can create today in the hands of a novice, we use ChatGPT to write a sci-fi movie pitch, so you can judge for yourself if it sounds original. These examples are also a way for me to share with you some of the ChatGPT prompting methods I found the most powerful. I'm not a professional screenwriter, nor am I trying to trivialize the creative process that have created many beloved sci-fi movies, not the least of which have included Star Wars, Blade Runner, and The Matrix. I'm a great fan of human-generated content. To what extent AI can generate or help generate iconic content remains to be seen. Please enjoy this solo episode. Welcome to the Generative AI Podcast. Join me, your host, Tony Wan, as I map the generative AI landscape via coffee conversations with world-class engineers, scientists, and entrepreneurs. Whether you're inside the industry or not, I hope to reveal something you haven't yet discovered. We laugh, we cry, we iterate for the tech-savvy, nerdy, and AI curious. In this episode, we're going to answer the question, can AI replace screenwriters? Actually, I'm not going to answer that question. I'm going to give you enough of a sense of what AI can do so that you can answer that question for yourself. As a side note, if anyone listening to this podcast has not yet tried Chat GPT, I encourage you to do so. It's very simple. You go to openai.com and just sign up for the service. There's no better way to find out what AI is capable of other than taking Chat GPT for a spin. I'm going to be sharing with you three power prompts that I've been using. Power prompt is just a term I invented. Perhaps I didn't invent it. There's other people using that term. It's just a way to describe the prompting technique I'm using. I'm going to share the three that I found the most powerful. The three are, number one, role play, number two, train of thought, and number three, self-critique. These aren't technical terms. It's just what I and other users of large language models seem to be calling these prompts. It's a way to communicate to other users what technique you're using. I've used these power prompts over a wide range of topics, including geopolitics, the search for extraterrestrial intelligence, and also what I'm doing now, which is using AI to learn about AI. I'll go through examples of each so that you can get a sense of how the quality of the output changes based on the prompt technique that I'm using. I've chosen this exercise of writing a sci-fi pitch mainly because we can judge the output without having specific domain expertise. All of us have opinions on what stories work and don't work. It's an easy way that all of us can judge the output of a child GPT. Also, this example is especially relevant now where, as of August 2023, there is an ongoing writer's strike in the USA. This is a writer's strike, but also an actor's strike. It's basically brought to standstill all film and TV production in the USA. One of the key negotiation sticking points is AI and how film studios and television networks use AI. For example, what is fair compensation for an actor or actress if the studio uses generative AI to reproduce their likeness in future works where they haven't explicitly done the acting? Also, another ongoing question of debate is to what extent can a film studio or television network use generative AI to write a script? It's a complicated issue, but I think both sides of the debate would be well served by learning more about AI and what it can and cannot do. That's what we intend to do here. Let's dive into this. I started out with this generic prompt to chat GPT. Write a 100-word pitch for an epic science fiction blockbuster, including the title. We're going to use the response to this generic prompt as the baseline for comparison. I will share what I believe to be more and more prompting techniques consecutively and show you how they yield better and better results. This is chat GPT's response to that very basic prompt. It gives me the title, Infinity's Edge, and here's its pitch. I'm not going to read you the whole pitch, which is 100 words, but I'll give you a sense of it by reading you apart. Here's chat GPT's response to the basic prompt, title, Infinity's Edge. In the distant future, as Earth faces extinction, an intrepid crew of brilliant scientists, daring space explorers, and unlucky heroes embark on a perilous mission to the uncharted reaches of the cosmos. Their quest to find and harness the power of a mythical cosmic artifact known as Infinity's Edge. Unimaginable challenges await them in the form of cosmic anomalies, malevolent entities, and internal conflicts pushing the limits of human courage and determination. Okay, what do you think of this movie pitch? I gave chat GPT a, I don't know, like a 10-word prompt, and this is what it came up with. It certainly sounds like a movie pitch, but it also is a bit incoherent. It's a mashup of different stuff that I think we've all seen before. It contains a lot of adverbs telling us what a great movie this will be instead of actually showing us what the movie is actually about. It's a mashup of different things that I think we've all seen before. If I were grading this, I would give it a C. Okay, it sounds like a movie pitch, but not great. Okay, so the next step is, can we improve upon this? And the way to improve upon this is to give chat GPT a specific role to play. I call this the role play power of the play. And I find that giving chat GPT a role to play is the easiest way to up-level its response. I think it's just a way to give chat GPT very quickly the context, and that allows chat GPT to dial in more into what you're really looking for. So I'm going to ask chat GPT as its role to play an academy award-winning screenwriter. So the modified prompt using the role play power prompt would be, you are an academy award-winning screenwriter. Write a 100 word pitch for the epic science fiction blockbuster, including the title. And this is what chat GPT came back with based on that prompt. Title, Stellar Odyssey. In the distant future, our fractured humanity has colonized multiple star systems, each governed by ruthless factions vying for supremacy. Miss the Chaos, a young orphan, discovers a hidden map leading to the fabled Stellar Crystal, a legendary artifact said to hold unimaginable power. Aided by a battle-hardened space captain and an agnomatic alien scholar, they form an unlikely alliance to retrieve the crystal and end the interstellar war. Okay, what do you think? Is it better than the first pitch? I think it is. I like the bit about the young orphan as someone I can root for. Still, it sounds a bit derivative. That the young orphan discovers a hidden map leading to the fabled Stellar Crystal. Of course, this reminds me of Luke Skywalker discovering Princess Leia's message in R2-D2. And there are important details missing. For example, these two sides fighting the interstellar war. What forces do they represent? Should I be rooting for one or either side or should I not be rooting for either side? And where does the orphan fit in? Is the orphan part of one of these sides or is this orphan part of yet another side? So there's some really, I think, crucial elements missing from this pitch that would make it more cohesive. I would give it something like a maybe like a B-. So the question is, can we do better by using a better prompt? We can. There is a power prompt. I'm calling chain of thought. There's actually been some academic papers written about this way of prompting large language models. This is a technique where you ask Chachi BT to explicitly go through the steps that allow it to arrive to its final answer. Okay. So our modified prompt is, you are an Academy Award-winning screenwriter. Write a 100-word pitch for an epic science fiction blockbuster, including the title. Build a compelling world. Create characters we care about. Tell a story with a satisfying arc. Notice that these steps that we're explicitly outlining, building a compelling word, creating characters we care about, making sure that the author is making sure that the arc is satisfying. These are things Chachi BT implicitly has to do when it comes up with a movie script. Otherwise, I'm sorry, a movie pitch. Otherwise, it wouldn't sound like a movie pitch. So it has already a sense that these are important steps, but outlining that they should explicitly go through the steps, up levels of the response. And to sum up some of these academic papers speculating why, it's a way to help the LLM, large language model, think through the answer. Much like how our answers might get better if we really think through the process by which we arrive at the answer. Okay. So what does it come back with based on that power prompt? So it creates another movie pitch with a new title. And the new title is Eclipse of Eternity. In a future where advanced AI governs the galaxy, an enigmatic anomaly known as Eclipse of Eternity threatens to erase all recorded history. A brilliant historian haunted by a tragic past and an enigmatic rogue AI form an uneasy alliance to unravel the mystery behind the anomaly. This pitch goes on for another 50 words, but that gives you a sense of what it's pitching. Okay, so what do you think so far? Is that a more compelling pitch? I think so. What I liked about this pitch, not even having read to you the whole thing, is that it's a buddy sci fi film. And one buddy is a rogue AI, which I found really interesting because we think typically of a rogue AI as evil. But in this pitch, it flips that and it's kind of a buddy. The script creates questions that I may want to go see a movie to get answered. For example, what kind of evil entity would want to erase history and why? And just how does one go about erasing history? And finally, a brilliant historian and a rogue AI duo are such an odd couple that I really want to go find out how they go about stopping this evil plan. This pitch shows promise, but the idea requires more development. Can we do better? We can by using the next power prompt, which I call self-critique. Self-critique is sometimes referred to as judging as well. And in this technique, we're leveraging what AI is very good at, which is evaluating things. It's less good at generating truly original concepts, but it's actually pretty good at judging between concepts that you present to it. So how you can use this in a very powerful way is you make it generate lots and lots of ideas. And just based on the law of large numbers and the natural randomness of its responses, out of many responses, say 100 responses, there may be a few original concepts responses, there may be a few original ones that it comes up with, and you ask itself to judge and pick out its best responses. So in this case, we're not going to ask it to generate 100 responses. We're just going to ask it to generate three, but it will show you the power of this prompting technique. And the other nice thing is that when you're asking it to generate lots of concepts, when you're asking chat GPT or AI, unlike a human, it won't consider this task tedious and boring and won't complain, it will just go do it. So in this last prompting example, what I did is I combined all three of these power prompts. Role play, the second we used was train of thought, and the final self critique. And together, it makes for a pretty powerful prompt. You may even call it a super prompt. Although that term seems to be a little bit overused at the moment. So here's the prompt. You are for Academy Award winning screenwriters, ABC and D, partaking in a screenwriting competition. Screenwriters ABC each present a 100 word pitch for an epic science fiction blockbuster that would be judged based on building a compelling world creating characters we care about and storytelling with a satisfying arc. And notice that's the chain of thought prompting technique. Screenwriter D picks the best screenplay and explains why. So we're also using role playing here because we're asking the AI to pretend it's four different screenwriters, three that present the concept and one that does the judging. And what makes this a self critique prompt is that we're asking AI to judge between a couple of different choices that is generated. Again, we're asking it only to generate three screenplays, but we could easily ask it to generate many, many more. One question is it's unclear what the magic number is for it to generate something interesting. Is three enough of a sample size or do you need a hundred or do you need a thousand? This is a question I don't know the answer to. It's something worth exploring in future podcasts. Chat GPT's output to this prompt is quite long because it generates movie pitches from three screenwriters. So I'll read you a bit of each screenwriter's pitch. We start with screenwriter A. This person's title is Chronicles of Celestia. In the distant future, Earth faces impending doom as a cosmic cataclysm threatens to consume the planet. In a last ditch effort to save humanity, a diverse group of scientists, soldiers, and civilians board an experimental spacecraft seeking refuge on a distant habitable moon called Celestia. Not bad, right? Sounds a bit like the movie Interstellar, which I really enjoyed, but still it could be interesting. I'm like, okay, tell me more. Screenwriter B. The title of this person's movie is Elysian Fields. In a post-apocalyptic world, society has retreated to massive floating cities, harnessing the last remaining resources. Amidst the rising unrest, a resourceful scavenger and an ambitious scientist uncover a hidden message from an ancient civilization. Revealing the existence of an untouched paradise on Earth called the Elysian Fields. Again, not bad, right? I like the mythological reference in the title. In Greek mythology, there's a blissful place called the Elysian Fields. So it's kind of cool that they use this reference to old mythology in this new sci-fi context. Actually, the most fun part, I think, of this exercise has been the titles of movies that AI generated. They're all kind of funny and interesting. I don't necessarily think they work, but still I'm like, good try. All right, so Screenwriter C. The title of this screenwriter's movie is Nexodus. In a future where tyrannical AI rules with an iron fist, a group of rebels fights to liberate humanity. As they infiltrate the AI's central hub, a prodigious hacker discovers an ancient code holding the key to AI's origins and its weaknesses. Aided by a charismatic leader and a reformed AI assistant, they embark on a mind-bending journey through virtual realms in parallel dimensions. With time running out, they must confront their deepest fears and unite to rewrite the destiny of humankind. Nexodus is a gripping tale of redemption, hope, and the power of collective consciousness. Also, pretty good, right? So which would you pick as the winner? So we have Screenwriter A, Chronicles of Celestia, which is humanity's search for a habitable moon. Screenwriter B, Elysian Fields, humanity's search for untouched paradise on Earth. And finally, Screenwriter C, Nexodus, humanity's fight to liberate itself from a tyrannical AI. Humanities fight to liberate itself from a tyrannical AI. Drum roll please. And the winner is, let me open the envelope, Nexodus by Screenwriter C. That's the winner chosen by our chat GBT AI judge, which as you recall, is Screenwriter D playing the role of an Academy Award-winning screenwriter. So this Screenwriter D's comments from chat GBT is the following. And I'm not going to read you all of it, but I'll read you part of this screenwriter's comments. The intricate concept of battling against a tyrannical AI coupled with the exploration of virtual realms and parallel dimensions creates an engrossing and thought-provoking narrative. The diverse and dynamic characters, especially the reformed AI assistant, add depth and emotional resonance. I laugh because it feels the most interesting part of this is the AI part. The screenplay's exploration of collective consciousness and ultimate power of human connection sets it apart, providing a satisfying arc, and resonates beyond the final frame. You know, it's weird because these comments sound like a movie review, don't they? So it's a little bit imitative in my opinion, but you get the sense of it, right? So our chat GBT AI judge picked Nexodus as the winning screenplay. And I read you actually it's the whole pitch because I thought it was actually of all the pitches we've examined today, to me was the best put together pitch. If I were to give this pitch a grade, the Nexodus pitch, I'd give it a B+. It actually was my favorite pitch as well. I like the title. It's catchy. It's a combination of words and Nexodus is a combination of the words Nex and Exodus. Really clever, I thought. I like the trail of leader hacker in AI. I like the concept of a tyrannical AI that has a weakness going back to the first days it was coded. Perhaps it's code being written right now today in 2023. I like to think that in the future, some deep forgotten buried AI subroutine written in 2023 becomes the key to saving humanity. I like that. Mainly because I've developed software before for legacy telephone systems, where I've run in personally run into ancient code written in Pascal, which is a programming language near the origins of programming languages. We would run into these pieces of code that we knew were important, but we didn't know exactly what we did. We were terrified and messing with it because we thought we might break something really important. Often we did whenever we touched these little ancient bits of code. I love this idea that there's a little ancient bit of code that somehow is the key in the future to saving humanity. Finally, I love the nice touch about collective consciousness in the pitch, where AI is implicitly included as part of that consciousness. I have no idea if Chate GBT intentionally created that little nuance. I guess I could have asked Chate GBT whether that part was intentional at the time, but it just occurred to me as I was writing the script for this podcast that that was a nice little touch. Would you like to see the film Exodus based on this pitch? I would, especially if it had an A-list actor in it, perhaps Linda Hamilton playing the role of the charismatic leader. So something to note about getting to this final movie pitch, it took me hours of working with Chate GBT to come up with this movie pitch. I'm not a professional screenwriter. I've never written a screenplay, so I really have no idea how one goes about this, but just massaging Chate GBT into creating something I thought sounded reasonable took a lot of effort. And still there was ways to make the final pitch better. Exodus isn't a perfect pitch, and I'm sure a professional screenwriter that has experience that's good could make it way better and turn it into an A-plus pitch. Okay, so now let's go back to the topic of the Hollywood writer strike that is ongoing in the year 2023. How would you answer our original question, can AI replace screenwriters? My understanding of the current Writers Guilds of America, WGA, position is that the film studios and television networks cannot use, they would be prohibited from using AI to generate scripts, or ask writers to rewrite a script AI has generated. Their position is their current position, let's just say because they're in the midst of negotiations, so it's unclear what the final negotiated position will be. But their current position as of August 2023 is that the writing must be 100% human effort. My understanding. So if the studios accept the current position of the WGA, the studios would not be able to do what we just did. As a side note, personally, at the present moment, it's really hard for me to imagine AI generating a movie script that is truly groundbreaking and iconic on its own, without significant help from an experienced and good human storyteller. It was a time consuming exercise just to come up with a movie pitch, and I imagine coming up with a full blown A plus movie script using the help of AI would still be laborious. However, creating a C level or B minus level script may not require much work at all. So think about your favorite sci-fi movies of all time, movies like Star Wars, Back to the Future, The Matrix. Could AI create something like that on its own? I don't think we're there yet. That's my personal sense of where this technology is today. But the key word is yet. We're still very early. But on the other hand, what AI generates in the hands of someone experienced isn't terrible. I think something that may take me hours to do as an inexperienced screenwriter, a screenwriter with experience could, via the help of AI, just turn out C level or B minus level scripts very quickly. Certainly, there are sci-fi movies with plots a lot less compelling than what I just read you being written, produced, and watched today. So what do you think? Can AI replace screenwriters? And moreover, should it? I'll let you answer these questions for yourself. In this podcast episode, I've shared with you the power prompts of role play, chain of thought, and self-critique. Mainly, it's to allow you to explore the capabilities of AI, for yourself. So you can form your own hypothesis of how it will impact the creative fields. And to help you get a better sense from this technology so that you can define your relationship to it and how you want to work with it. Creating this episode generated a lot of observations and follow-on questions for me. Here are some of them. Number one, the more domain expertise you have, the better your questions, the more creative you are, the better its output will be. So the follow-on question to that, so what is the ideal combination of AI and human creativity? The second observation, the more time you put in to crafting something with AI, the more you feel the output is yours. There's a sense of ownership. You've created something AI could not have come up on its own. So the following question to that is, to what extent as a creative, do I own what I co-create with AI? Finally, the third observation, the creative potential of AI, either on its own or with humans, is undeniable. So the following question to that is, what is my relationship to generative AI technology? Is it friend or foe? And is there a way I can co-opt this technology before it co-ops me? Before I end this podcast, I want to give a shout out to Todd Garner, the creator of the Producers Guide podcast, which introduced me to Billy Ray's podcast. He's a great guy. Billy Ray is an American screenwriter and film director. It's Billy's podcast that keyed me in about the AI issues that writers and actors are concerned about. I encourage you to check out Todd's podcast if you want to learn about producing in Hollywood. Actually, it's great. He interviews all sorts of actors and writers and producers and directors. He's a great actor. It's great. He interviews all sorts of actors and writers and producers, some very famous people, and gives you really some insights into the internal workings of Hollywood. And Billy's podcast, if you want to understand how AI is impacting real people in Hollywood today and why these people are going on strike in the year 2023. My personal belief is AI should not replace human creativity, but augment it. But architecting that in a way that is fair to all parties is far from clear and a work in progress. Thanks for listening to my 18th episode. I'm Tony Wan, your host for the Generative AI podcast. If you like what you heard here on YouTube, check out my podcast. There are more episodes and I will see you the next time on the Generative AI podcast. Thanks for joining us at the Generative AI podcast. If you liked what you heard, please subscribe to this podcast and leave us a five-star review. See you next week at the Generative AI podcast."}, "podcast_summary": "In this podcast episode, the host explores the question of whether AI can replace screenwriters in Hollywood. They use the example of using OpenAI's ChatGPT to generate a sci-fi movie pitch and analyze the results using different prompting techniques, such as role play, train of thought, and self-critique. The host discusses the ongoing writer's strike in Hollywood and the negotiations around the use of AI in film and TV production. They conclude that while AI can assist in generating ideas, the creativity and storytelling abilities of human screenwriters are still essential. The host encourages listeners to form their own opinions on the role of AI in creative fields.", "podcast_author": {"name": "Tony Wan", "org": "Generative AI Podcast", "title": "", "summary": "Not Available"}, "podcast_highlights": "Highlights from the podcast episode:\n\n1. \"Can AI replace screenwriters? I'm going to give you enough of a sense of what AI can do so that you can answer that question for yourself.\" \n2. \"Using the power prompts of role play, chain of thought, and self-critique, we will explore the capabilities of AI and its impact on the creative fields.\"\n3. \"The more domain expertise you have, the better the AI's output will be. So what is the ideal combination of AI and human creativity?\"\n4. \"The more time you put into crafting something with AI, the more you feel the output is yours. So to what extent do I own what I co-create with AI?\"\n5. \"The creative potential of AI, either on its own or with humans, is undeniable. So what is my relationship to generative AI technology?\""}